{
    "ToT": {
        "rec1": {
            "text": "Increase your daily steps to at least 13000.",
            "validation": {
                "personalization_score": 9.5,
                "groundness_score": 8.5,
                "scores_explanation": "The positive effects of steps on your stress score (0.26) show that adding more steps into your day can improve your stress levels. This also aligns with scientific evidence that exercise is a powerful stress reliever. However, your recent daily average of steps (11921 from the last 7 days) is already quite high, therefore the room for improvement is lower."
            }
        },
        "rec2": {
            "text": "Try to reduce your sedentary minutes by incorporating more regular movement intervals into your day.",
            "validation": {
                "personalization_score": 10,
                "groundness_score": 9.5,
                "scores_explanation": "Your data shows a strong negative effect of sedentary minutes on your stress score (-0.66) making this a very personalized recommendation for you. This also aligns with literature showing the detrimental effects of sedentary behavior on psychological health. As your average daily sedentary minutes from the last 7 days is 669 minutes, there is room for improvement."
            }
        },
        "rec3": {
            "text": "Improve your sleep quality by integrating a consistent sleep routine which includes deep breathing or meditation before bed.",
            "validation": {
                "personalization_score": 8.5,
                "groundness_score": 8.5,
                "scores_explanation": "Your data shows a relatively high positive impact of deep sleep (0.51), light sleep (0.61), and REM sleep (0.53) on your stress score. Hence, improving sleep quality could likely positively affect your stress levels. General scientific literature also shows that good sleep is critical for maintaining a good stress level. However, your sleep ratios and duration show good values already, hence the room for improvement is not very high."
            }
        }
    },
    "final_recommendation": {
        "text": "Try to reduce your sedentary minutes by incorporating more regular movement intervals into your day.",
        "explanation": "Recently, you've been spending quite a bit of time seated, and this might be impacting your stress levels. When you sit for long periods of time, your body isn't as active as it could be, which can actually increase stress. To combat this, try to incorporate regular movement intervals into your day. This could be as simple as standing up and stretching every 30 minutes, or taking a short walk during your breaks. You might be surprised by how such a small change can make a big difference!"
    }
}